_posts/2021-10-02-abc221-c-upsolving.html
---
layout: post
title: abc221 C - Select Mul
tags: AtCoder 완전탐색
---

<div id="outline-container-org8137813" class="outline-2">
<h2 id="org8137813">C - Select Mul</h2>
</div>

<div id="outline-container-org012b163" class="outline-2">
<h2 id="org012b163">접근하기</h2>
<div class="outline-text-2" id="text-org012b163">
<ul class="org-ul">
<li>최대 9자리 숫자 순열을 만들어서 모두 해볼 수 있다.</li>
<li>두 구간으로 나눔, left, right</li>
<li>숫자의 길이가 홀수이면, left쪽이 1자리수 더 길게 구성.</li>
<li>숫자의 길이가 짝수이면, left, right같게 구성.</li>
</ul>
</div>
</div>

<div id="outline-container-org15abc32" class="outline-2">
<h2 id="org15abc32">코드</h2>
<div class="outline-text-2" id="text-org15abc32">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;stdio.h&gt;</span>

<span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">str</span>[10];
<span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">a</span>[10];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">visit</span>[10];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">len</span>;

<span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #ff6347;">ans</span>;

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">bt</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>) {
    <span style="color: #729fcf; font-weight: bold;">if</span> (idx == len) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">mid</span> = (len %2 == 0) ? len/2 : (len/2)+1;

        <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #ff6347;">num1</span> = 0;
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;mid;i++) {
            num1 = num1 * 10 + (a[i] - <span style="color: #ad7fa8; font-style: italic;">'0'</span>);
        }
        <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #ff6347;">num2</span> = 0;
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=mid;i&lt;len;i++) {
            num2 = num2 * 10 + (a[i] - <span style="color: #ad7fa8; font-style: italic;">'0'</span>);
        }
        <span style="color: #729fcf; font-weight: bold;">if</span> (ans &lt; num1 * num2) ans = num1 * num2;            
        <span style="color: #729fcf; font-weight: bold;">return</span>;
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;len;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (visit[i] == 0) {
            visit[i] = 1; 
            a[idx] = str[i];
            bt(idx+1);
            visit[i] = 0; 
        }    
    }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    ans = 0;
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%s"</span>, str);
    <span style="color: #729fcf; font-weight: bold;">for</span>(len=0;str[len];len++);

    bt(0);
    printf(<span style="color: #ad7fa8; font-style: italic;">"%lld\n"</span>, ans);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga04fe08" class="outline-2">
<h2 id="orga04fe08">문제 링크</h2>
<div class="outline-text-2" id="text-orga04fe08">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc221/tasks/abc221_c">https://atcoder.jp/contests/abc221/tasks/abc221_c</a></li>
</ul>
</div>
</div>
